# Python MySQL connection

### Install module

In [1]:
# Install mysql-connector-python, if not already installed
# !pip install mysql-connector-python

In [2]:
# Import the mysql.connector library/module
import mysql.connector

### Create connection to MySQL server

In [3]:
# Create the connection object
mydb = mysql.connector.connect(
    host="localhost",
    user="admin1",
    password="?????????",
)

In [4]:
# Create a cursor object
cursor = mydb.cursor()

### Create database pseudonym_db

In [5]:
# Drop database if it already exists
cursor.execute("DROP DATABASE IF EXISTS pseudonym_db")

# Create database
cursor.execute("CREATE DATABASE pseudonym_db")

# Use database
cursor.execute("USE pseudonym_db")

# Inform user that database was created successfully
print("Database created successfully...")

Database created successfully...

### Create tables 'categories', 'names', 'pseudonyms' and 'relationship'

In [6]:
# SQL statement to Drop table categories if it already exists
drop_table_categories = """ DROP TABLE IF EXISTS categories; """

# SQL statement to create table categories
create_table_categories = """ CREATE TABLE categories (
  category_id int NOT NULL PRIMARY KEY,
  category text
); """

# Execute the DROP TABLE statement
cursor.execute(drop_table_categories)

# Execute the CREATE TABLE statement
cursor.execute(create_table_categories)

# Commit the changes
mydb.commit()

# Inform user that table was created successfully
print("Table 'categories' created successfully...")

Table 'categories' created successfully...

In [7]:
# SQL statement to drop table real_names if it already exists
drop_table_real_names = """ DROP TABLE IF EXISTS names; """

# SQL statement to create table real_names
create_table_real_names = """ CREATE TABLE names (
  name_id int NOT NULL PRIMARY KEY,
  name text,
  date_of_birth int DEFAULT NULL
); """

# Execute the DROP TABLE statement
cursor.execute(drop_table_real_names)

# Execute the CREATE TABLE statement
cursor.execute(create_table_real_names)

# Commit the changes
mydb.commit()

# Inform user that table was created successfully
print("Table 'names' created successfully...")

Table 'names' created successfully...

In [8]:
# SQL statement to drop table pseudonyms if it already exists
drop_table_pseudonyms = """ DROP TABLE IF EXISTS pseudonyms; """

# SQL statement to create table pseudonyms
create_table_pseudonyms = """ CREATE TABLE pseudonyms (
  pseudonym_id int NOT NULL PRIMARY KEY,
  pseudonym text
); """

# Execute the DROP TABLE statement
cursor.execute(drop_table_pseudonyms)

# Execute the CREATE TABLE statement
cursor.execute(create_table_pseudonyms)

# Commit the changes
mydb.commit()

# Inform user that table was created successfully
print("Table 'pseudonyms' created successfully...")

Table 'pseudonyms' created successfully...

In [9]:
# SQL statement to drop table relationship  if it already exists
drop_table_relationship = """ DROP TABLE IF EXISTS relationship; """

# SQL statement to create table relationship
create_table_relationship = """ CREATE TABLE relationship (
  relationship_id int AUTO_INCREMENT PRIMARY KEY,
  name_id int NOT NULL,
  pseudonym_id int NOT NULL,
  category_id int NOT NULL,
  FOREIGN KEY (name_id) REFERENCES names(name_id),
  FOREIGN KEY (pseudonym_id) REFERENCES pseudonyms(pseudonym_id),
  FOREIGN KEY (category_id) REFERENCES categories(category_id)
); """

# Execute the DROP TABLE statement
cursor.execute(drop_table_relationship)

# Execute the CREATE TABLE statement
cursor.execute(create_table_relationship)

# Commit the changes
mydb.commit()

# Inform user that table was created successfully
print("Table 'relationship' created successfully...")

Table 'relationship' created successfully...

### Insert data into the tables

In [10]:
# SQL statement to insert data into table categories
insert_into_table_categories = """ INSERT INTO categories (category_id, category) VALUES 
(1,'Architecture'),
(2,'Espionage '),
(3,'Literature'),
(4,'Medicine'),
(5,'Film'),
(6,'Music'),
(7,'Painting'),
(8,'Philosophy'),
(9,'Politics'),
(10,'Statistics'); """

# Execute the INSERT INTO statement to insert data into table categories
cursor.execute(insert_into_table_categories)

# Commit the changes
mydb.commit()

# Inform user that data was inserted successfully
print("Data inserted successfully into table 'categories'...")

Data inserted successfully into table 'categories'...

In [11]:
# SQL statement to insert data into table names
insert_into_table_names = """ INSERT INTO names (name_id, name, date_of_birth) VALUES
(25,'Jorge Luis Borges',1899),
(12,'Herbert Frahm',1913),
(9,'François-Marie Arouet',1694),
(14,'Jacopo Robusti',1518),
(24,'William Sealy Gosset',1876),
(18,'Marie-Henri Beyle',1783),
(7,'Erich Kästner',1899),
(1,'Alexander Hamilton',1755),
(15,'James Madison',1751),
(16,'John Jay',1745),
(23,'Theophrastus Bombastus von Hohenheim',1493),
(20,'Ricardo Eliezer Neftalí Reyes Basoalto',1904),
(21,'Samuel Langhorne Clemens',1835),
(19,'Norma Jeane Mortenson',1926),
(17,'Lew Dawidowitsch Bronstein',1879),
(4,'Charles-Édouard Jeanneret',1887),
(22,'Søren Kierkegaard',1813),
(8,'Farrokh Bulsara',1946),
(6,'Emily Brontë',1818),
(11,'Giovanni di Niccolò de Luteri',1469),
(5,'Charlotte Brontë',1816),
(13,'Italo Svevo',1861),
(10,'Giacomo Casanova',1725),
(3,'Antonio Rodolfo Quinn Oaxaca',1915),
(2,'Anne Brontë',1820); """

# Execute the INSERT INTO statement to insert data into table names
cursor.execute(insert_into_table_names)

# Commit the changes
mydb.commit()

# Inform user that data was inserted successfully
print("Data inserted successfully into table 'names'...")

Data inserted successfully into table 'names'...

In [12]:
# SQL statement to insert data into table pseudonyms
insert_into_table_pseudonyms = """ INSERT INTO pseudonyms (pseudonym_id, pseudonym) VALUES
(27,'H. Bustos Domecq'),
(26,'Willy Brandt'),
(25,'Voltaire'),
(24,'Tintoretto'),
(23,'Student'),
(22,'Stendahl'),
(21,'Robert Neuner'),
(20,'Publius'),
(19,'Peter Flint'),
(18,'Paracelsus'),
(17,'Pablo Neruda'),
(16,'Melchior Kurtz'),
(15,'Mark Twain'),
(14,'Marilyn Monroe'),
(13,'Leo Trotzki'),
(12,'Le Corbusier'),
(11,'Johannes de Silentio'),
(10,'Freddie Mercury'),
(9,'Ellis Bell'),
(8,'Dosso Dossi'),
(7,'Currer Bell'),
(6,'Constantin Constantius'),
(5,'Berthold Bürger'),
(4,'Aron Hector Schmitz'),
(3,'Antonio Pratolini'),
(2,'Anthony Quinn'),
(1,'Acton Bell'); """

# Execute the INSERT INTO statement to insert data into table pseudonyms
cursor.execute(insert_into_table_pseudonyms)

# Commit the changes
mydb.commit()

# Inform user that data was inserted successfully
print("Data inserted successfully into table 'pseudonyms'...")

Data inserted successfully into table 'pseudonyms'...

In [13]:
# SQL statement to insert data into table relationship
insert_into_table_pseudonyms = """ INSERT INTO relationship (pseudonym_id, name_id, category_id) VALUES
(27,25,3),
(26,12,9),
(25,9,8),
(24,14,7),
(23,24,10),
(22,18,3),
(21,7,3),
(20,1,9),
(20,15,9),
(20,16,9),
(19,7,3),
(18,23,4),
(17,20,3),
(16,7,3),
(15,21,3),
(14,19,5),
(13,17,9),
(12,4,1),
(11,22,8),
(10,8,6),
(9,6,3),
(8,11,7),
(7,5,3),
(6,22,8),
(5,7,3),
(4,13,3),
(3,10,2),
(2,3,5),
(1,2,3); """

# Execute the INSERT INTO statement to insert data into table pseudonyms
cursor.execute(insert_into_table_pseudonyms)

# Commit the changes
mydb.commit()

# Inform user that data was inserted successfully
print("Data inserted successfully into table 'relationship'...")

Data inserted successfully into table 'relationship'...

### Query the pseudonyms and the corresponding official names

In [14]:
# SQL statement to select the Number of Pseudonyms per Name
select_pseudonyms_and_names = """ SELECT pseudonyms.pseudonym AS 'Pseudonym', names.name AS 'Name' 
FROM pseudonyms
INNER JOIN relationship ON pseudonyms.pseudonym_id = relationship.pseudonym_id
INNER JOIN names ON relationship.name_id = names.name_id
ORDER BY 1 asc, 2 asc; """

# Execute the SELECT statement to select the Number of Pseudonyms per Name
cursor.execute(select_pseudonyms_and_names)

# Fetch all the rows
result = cursor.fetchall()

# Column names
column_names = cursor.column_names

# Print the result
print("Here are the pseudonyms and the corresponding names:")
print("----------------------------")
print("Column names:")
print("----------------------------")
print(column_names[0], ' --> ', column_names[1])
print("----------------------------")
for row in result:
    print(row[0], ' --> ', row[1])

Here are the pseudonyms and the corresponding names:
----------------------------
Column names:
----------------------------
Pseudonym  -->  Name
----------------------------
Acton Bell  -->  Anne Brontë
Anthony Quinn  -->  Antonio Rodolfo Quinn Oaxaca
Antonio Pratolini  -->  Giacomo Casanova
Aron Hector Schmitz  -->  Italo Svevo
Berthold Bürger  -->  Erich Kästner
Constantin Constantius  -->  Søren Kierkegaard
Currer Bell  -->  Charlotte Brontë
Dosso Dossi  -->  Giovanni di Niccolò de Luteri
Ellis Bell  -->  Emily Brontë
Freddie Mercury  -->  Farrokh Bulsara
H. Bustos Domecq  -->  Jorge Luis Borges
Johannes de Silentio  -->  Søren Kierkegaard
Le Corbusier  -->  Charles-Édouard Jeanneret
Leo Trotzki  -->  Lew Dawidowitsch Bronstein
Marilyn Monroe  -->  Norma Jeane Mortenson
Mark Twain  -->  Samuel Langhorne Clemens
Melchior Kurtz  -->  Erich Kästner
Pablo Neruda  -->  Ricardo Eliezer Neftalí Reyes Basoalto
Paracelsus  -->  Theophrastus Bombastus von Hohenheim
Peter Flint  -->  Erich Kästner
Publius  -->  Alexander Hamilton
Publius  -->  James Madison
Publius  -->  John Jay
Robert Neuner  -->  Erich Kästner
Stendahl  -->  Marie-Henri Beyle
Student  -->  William Sealy Gosset
Tintoretto  -->  Jacopo Robusti
Voltaire  -->  François-Marie Arouet
Willy Brandt  -->  Herbert Frahm

### Find the most common categories of pseudonyms

In [15]:
# SQL statement to find categories of pseudonyms, that have more than one pseudonym
select_most_common_category = """ SELECT COUNT(relationship.category_id) AS 'Number of Pseudonyms', categories.category AS 'Category'
FROM relationship
INNER JOIN categories ON relationship.category_id = categories.category_id
GROUP BY categories.category
HAVING COUNT(relationship.category_id) > 1
ORDER BY 1 desc;
"""

# Execute the SELECT statement to select the Number of Pseudonyms per Name
cursor.execute(select_most_common_category)

# Fetch all the rows
result = cursor.fetchall()

# Column names
column_names = cursor.column_names

# Print the result
print("Here are the most common categories:")
print("----------------------------")
print("Column names:")
print("----------------------------")
print(column_names[0], ' --> ', column_names[1])
print("----------------------------")
for row in result:
    print(row[0], ' --> ', row[1])

Here are the most common categories:
----------------------------
Column names:
----------------------------
Number of Pseudonyms  -->  Category
----------------------------
12  -->  Literature
5  -->  Politics
3  -->  Philosophy
2  -->  Film
2  -->  Painting

### Find the number of pseudonyms per name

In [16]:
# SQL statement to select the number of pseudonyms per name
select_number_of_pseudonyms_per_name = """ SELECT COUNT(relationship.name_id) AS 'Number of Pseudonyms', names.name AS 'Name' 
FROM relationship
INNER JOIN names
ON relationship.name_id = names.name_id
GROUP BY names.name
ORDER BY 1 desc, 2 asc; """

# Execute the SELECT statement to select the Number of Pseudonyms per Name
cursor.execute(select_number_of_pseudonyms_per_name)

# Fetch all the rows
result = cursor.fetchall()

# Column names
column_names = cursor.column_names

# Print the result
print("Here is the number of pseudonyms per name:")
print("----------------------------")
print("Column names:")
print("----------------------------")
print(column_names[0], ' --> ', column_names[1])
print("----------------------------")
for row in result:
    print(row[0], ' --> ', row[1])

Here is the number of pseudonyms per name:
----------------------------
Column names:
----------------------------
Number of Pseudonyms  -->  Name
----------------------------
4  -->  Erich Kästner
2  -->  Søren Kierkegaard
1  -->  Alexander Hamilton
1  -->  Anne Brontë
1  -->  Antonio Rodolfo Quinn Oaxaca
1  -->  Charles-Édouard Jeanneret
1  -->  Charlotte Brontë
1  -->  Emily Brontë
1  -->  Farrokh Bulsara
1  -->  François-Marie Arouet
1  -->  Giacomo Casanova
1  -->  Giovanni di Niccolò de Luteri
1  -->  Herbert Frahm
1  -->  Italo Svevo
1  -->  Jacopo Robusti
1  -->  James Madison
1  -->  John Jay
1  -->  Jorge Luis Borges
1  -->  Lew Dawidowitsch Bronstein
1  -->  Marie-Henri Beyle
1  -->  Norma Jeane Mortenson
1  -->  Ricardo Eliezer Neftalí Reyes Basoalto
1  -->  Samuel Langhorne Clemens
1  -->  Theophrastus Bombastus von Hohenheim
1  -->  William Sealy Gosset

### Find collective pseudonymy shared by two or more persons

In [17]:
# SQL statement to find collective pseudonyms with subquery
select_collective_pseudonyms = """ SELECT pseudonyms.pseudonym AS 'Collective pseudonym', names.name AS 'Name'
FROM pseudonyms
INNER JOIN relationship ON pseudonyms.pseudonym_id = relationship.pseudonym_id
INNER JOIN names ON relationship.name_id = names.name_id
WHERE relationship.pseudonym_id IN 
(SELECT pseudonym_id FROM relationship GROUP BY pseudonym_id HAVING COUNT(pseudonym_id) > 1)
; """

# Execute the SELECT statement to find collective pseudonyms
cursor.execute(select_collective_pseudonyms)

# Fetch all the rows
result = cursor.fetchall()

# Column names
column_names = cursor.column_names

# Print the result
print("Here are the collective pseudonyms with the corresponding official names:")
print("----------------------------")
print("Column names:")
print("----------------------------")
print(column_names[0], ' --> ', column_names[1])
print("----------------------------")
for row in result:
    print(row[0], ' --> ', row[1])

Here are the collective pseudonyms with the corresponding official names:
----------------------------
Column names:
----------------------------
Collective pseudonym  -->  Name
----------------------------
Publius  -->  Alexander Hamilton
Publius  -->  James Madison
Publius  -->  John Jay

### Find the oldest bearer of a pseudonym

In [18]:
# SQL statement to find the oldest bearer of a pseudonym
select_oldest_bearer = """ SELECT pseudonyms.pseudonym AS 'Pseudonym', 
names.name AS 'Name', 
names.date_of_birth AS 'Date of Birth',
categories.category AS 'Category'
FROM pseudonyms
INNER JOIN relationship ON pseudonyms.pseudonym_id = relationship.pseudonym_id
INNER JOIN names ON relationship.name_id = names.name_id
INNER JOIN categories ON relationship.category_id = categories.category_id
WHERE names.date_of_birth = (SELECT MIN(date_of_birth) FROM names)
; """

# Execute the SELECT statement to find the oldest bearer of a pseudonym
cursor.execute(select_oldest_bearer)

# Fetch all the rows
result = cursor.fetchall()

# Column names
column_names = cursor.column_names

# Print the result
print("Here is the oldest bearer of a pseudonym:")
print("----------------------------")
print("Column names:")
print("----------------------------")
print(column_names[0], ' --> ', column_names[1], ' --> ', column_names[2], ' --> ', column_names[3])
print("----------------------------")
for row in result:
    print(row[0], ' --> ', row[1], ' --> ', row[2], ' --> ', row[3])

Here is the oldest bearer of a pseudonym:
----------------------------
Column names:
----------------------------
Pseudonym  -->  Name  -->  Date of Birth  -->  Category
----------------------------
Dosso Dossi  -->  Giovanni di Niccolò de Luteri  -->  1469  -->  Painting

### Close cursor and connection

In [19]:
# Close the cursor and connection
cursor.close()

# Inform user that connection was closed
print("Connection closed successfully...")

Connection closed successfully...

In [20]:
# Close the connection
mydb.close()

# Inform user that connection was closed
print("Connection closed successfully...")

Connection closed successfully...